app/Http/Middleware/Locale.php

select * from `languages` where `is_active` = 1
select `code` from `languages` where `is_default` = 1 limit 1
---
    public function handle($request, Closure $next)
    {
        // Set config translatable.locales
        if (Schema::hasTable('languages')) {
            $languages = Language::query()
                ->where('is_active', Language::STATUS_ACTIVE)
                ->get()->toArray();

            $language_default = Language::query()
                ->where('is_default', Language::IS_DEFAULT)
                ->first('code');