app/Notification.php

    public static function countRegistration()
    {
        return Notification::where('user_id','!=',null)->where('is_read','=',0)->orderBy('id','desc')->get()->count();
---
select * from `notifications` where `user_id` is not null and `is_read` = 0 order by `id` desc

    public static function countBooking()
    {
        return Notification::where('booking_id','!=',null)->where('is_read','=',0)->orderBy('id','desc')->get()->count();
---
select * from `notifications` where `booking_id` is not null and `is_read` = 0 order by `id` desc