app/Setting.php

    public static function getAllSettings()
    {
        return self::all();
---
select * from `settings`