app/Http/Controllers/Frontend/ViewController.php

    public function home(){

        $deals = TravelPackage::where('status', 1)
            ->with('images')
            ->with('flightDeal')
            ->with('hotelDeal')
            ->with('attractionDeal')
            ->limit(15)
            ->get();

        $places = Place::query()
        ->with('place_types')
        ->withCount('reviews')
        ->with('avgReview')
        ->withCount('wishList')
        ->where('status', Place::STATUS_ACTIVE)
        ->get();

        $sliders = Slider::all();

        $countryList = Country::all();

          $blog_posts = Post::query()
            ->with(['categories' => function ($query) {
                $query->where('status', Category::STATUS_ACTIVE)
                    ->select('id', 'name', 'slug');
            }])
            ->where('type', Post::TYPE_BLOG)
            ->where('status', Post::STATUS_ACTIVE)
            ->limit(3)
            ->orderBy('created_at', 'desc')
            ->get(['id', 'category', 'slug', 'thumb']);

            $popular_cities = City::query()
            ->with('country')
            ->withCount(['places' => function ($query) {
                $query->where('status', Place::STATUS_ACTIVE);
            }])
            ->where('status', Country::STATUS_ACTIVE)
            ->limit(12)
            ->get();

            $categories = Category::query()
            ->where('categories.status', Category::STATUS_ACTIVE)
            ->where('categories.type', Category::TYPE_PLACE)
            ->join('places', 'places.category', 'like', DB::raw("CONCAT('%', categories.id, '%')"))
            ->limit(10)
            ->get();

            $trending_places = Place::query()
            ->with('categories')
            ->with('city')
            ->with('place_types')
            ->withCount('reviews')
            ->with('avgReview')
            ->withCount('wishList')
            ->where('status', Place::STATUS_ACTIVE)
            ->limit(10)
            ->get();

        $testimonials = Testimonial::query()
            ->where('status', Testimonial::STATUS_ACTIVE)
            ->get();
---
select * from `flight_deals` where `flight_deals`.`package_id` in (1, 2)
select * from `hotel_deals` where `hotel_deals`.`package_id` in (1, 2)
select * from `travel_packages` where `status` = 1 limit 15
select avg(score) as aggregate, place_id from `reviews` where `reviews`.`place_id` in (35, 36, 37, 38) group by `place_id`
select * from `countries`
select `id`, `category`, `slug`, `thumb` from `posts` where `type` = 'blog' and `status` = 1 order by `created_at` desc limit 3
select * from `countries` where `countries`.`id` in (13)
select * from `categories` inner join `places` on `places`.`category` like CONCAT('%', categories.id, '%') where `categories`.`status` = 1 and `categories`.`type` = 'place' limit 10
select * from `cities` where `cities`.`id` in (23, 31, 34)
select * from `testimonials` where `status` = 1