app/Http/Controllers/BackEndViewController.php

select count(*) as aggregate from `cities`
select count(*) as aggregate from `places`
select count(*) as aggregate from `bookings`
select count(*) as aggregate from `reviews`
select count(*) as aggregate from `users`
select count(*) as aggregate from `sales`
select count(*) as aggregate from `purchases`
select count(*) as aggregate from `posts` where `type` = 'blog' and `status` = 1
select * from `bookings` order by `created_at` desc
select * from `places` where `places`.`id` in (33, 35)
select * from `users` where `users`.`id` in ('')
select * from `visa_applications` order by `id` desc
select count(*) as aggregate from `flight_bookings` where `payment_status` = '1'
select count(*) as aggregate from `hotel_bookings` where `payment_status` = '1'
select count(*) as aggregate from `package_bookings` where `payment_status` = '1'
select sum(`total_amount`) as aggregate from `flight_bookings` where `payment_status` = 1
select sum(`total_amount`) as aggregate from `hotel_bookings` where `payment_status` = 1
select sum(`total_amount`) as aggregate from `package_bookings` where `payment_status` = 1
select count(*) as aggregate from `flight_bookings` where `payment_status` = '1' and `user_id` = 1
select count(*) as aggregate from `hotel_bookings` where `payment_status` = '1' and `user_id` = 1
select count(*) as aggregate from `package_bookings` where `payment_status` = '1' and `user_id` = 1
select sum(`total_amount`) as aggregate from `flight_bookings` where `payment_status` = 1 and `user_id` = 1
select sum(`total_amount`) as aggregate from `hotel_bookings` where `payment_status` = 1 and `user_id` = 1
select sum(`total_amount`) as aggregate from `package_bookings` where `payment_status` = 1 and `user_id` = 1
---
    public function dashboard(){
        $count_cities = City::query()
        ->count();

    $count_places = Place::query()
        ->count();

    $count_bookings = Booking::query()
        ->count();

    $count_reviews = Review::query()
        ->count();

    $count_users = User::query()
        ->count();

    $count_sales = Sale::query()
    ->count();

    $count_purchases = Purchase::query()
    ->count();

    $count_posts = Post::query()
    ->where('type', Post::TYPE_BLOG)
    ->where('status', Post::STATUS_ACTIVE)
    ->count();

    $count_purchases = Purchase::query()
    ->count();

    $bookings = Booking::query()
    ->with('user')
    ->with('place')
    ->orderBy('created_at', 'desc')
    ->get();

        $visaApplications = VisaApplication::orderBy('id','desc')->get();
        $generalTotalFlightBookings = FlightBooking::where('payment_status','1')->count();
        $generalTotalHotelBookings = HotelBooking::where('payment_status','1')->count();
        $generalTotalPackageBookings    = PackageBooking::where('payment_status','1')->count();
        $generalSuccessfulFlightBookingPrice =  FlightBooking::where('payment_status',1)->sum('total_amount');
        $generalSuccessfulHotelBookingPrice  = HotelBooking::where('payment_status',1)->sum('total_amount');
        $generalSuccessfulPackageBookingPrice = PackageBooking::where('payment_status',1)->sum('total_amount');
        $userGeneralTotalFlightBookings = FlightBooking::where('payment_status','1')->where('user_id',auth()->id())->count();
        $userGeneralTotalHotelBookings = HotelBooking::where('payment_status','1')->where('user_id',auth()->id())->count();
        $userGeneralTotalPackageBookings    = PackageBooking::where('payment_status','1')->where('user_id',auth()->id())->count();
        $userGeneralSuccessfulFlightBookingPrice =  FlightBooking::where('payment_status',1)->where('user_id',auth()->id())->sum('total_amount');
        $userGeneralSuccessfulHotelBookingPrice  = HotelBooking::where('payment_status',1)->where('user_id',auth()->id())->sum('total_amount');
        $userGeneralSuccessfulPackageBookingPrice = PackageBooking::where('payment_status',1)->where('user_id',auth()->id())->sum('total_amount');