app/Http/Controllers/NotificationController.php

    public function user_notf_count()
    {
        $data = Notification::where('user_id','!=',null)->where('is_read','=',0)->get()->count();
---
select * from `notifications` where `user_id` is not null and `is_read` = 0

    public function booking_notf_count()
    {
        $data = Notification::where('booking_id','!=',null)->where('is_read','=',0)->get()->count();
---
select * from `notifications` where `booking_id` is not null and `is_read` = 0