app/Http/Controllers/SaleController.php

select * from `customers`
select * from `sales` order by `created_at` desc
---
    public function list()
    {
        $customer = Customer::all();

        $sales = Sale::query()
            ->orderBy('created_at', 'desc')
            ->get();

select * from `sale_details` where `sale_id` = '63'
select * from `users`
---
    public function genInvoice($id)
    {
        $sales = Sale::find($id);
        $saledetails = SaleDetails::where('sale_id', $id)->get();
        $users = User::all();